AAClasswork/W7D2/MusicApp/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save!
---
UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "b118vNybVnIicNw9SscMlQ"], ["id", 1]]