AAClasswork/W11D4/ToDos_project/app/controllers/api/todos_controller.rb

    def index
        @todo = Todo.all
---
SELECT "todos".* FROM "todos"