AAClasswork/W7D2/MusicApp/app/controllers/application_controller.rb

    def current_user
        return nil if session[:session_token].nil?
        @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "nL1yb9CEHgJRmH638qcw5A"], ["LIMIT", 1]]