AAClasswork/W7D2/MusicApp/app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands"
---
    def index
        @bands = Band.all

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", " kiets"], ["created_at", "2021-06-22 23:38:00.700529"], ["updated_at", "2021-06-22 23:38:00.700529"]]
---
    def create
        @band = Band.new(band_params)
        if @band.save!

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @band = Band.find(params[:id])