AAClasswork/W7D2/MusicApp/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", " a"], ["password_digest", "$2a$12$uCOPSFf9TC5JP0kvP7/MD.aVLCv4LIpTveMfHmiBzpJzx7Ixx1Y4K"], ["session_token", "pK2TvmrQCmjCUSkmiLx24g"]]
---
    def create
        @user = User.new(user_params)
        if @user.save!